Repository: EliteSCP/TextChat
Catalog: src/TextChat/Localizations/Language.*.resx
Languages: it, ko, pt

# ChatWelcome
source: Welcome to the chat!
it: Benvenuto nella chat!
ko: 채팅에 오신것을 환영합니다!
pt: Bem-vindo ao chat!

# CommandError
source: An error has occurred while executing the command!
it: Si è verificato un errore durante l'esecuzione del comando!
ko: 명령어를 사용하는 도중에 오류가 발생했습니다!
pt: Ocorreu um erro ao executar o comando!

# CommandException
source: {0} command error: {1}
it: Errore del comando {0}: {1}
ko: {0} 명령어를 사용하는 도중에 오류가 발생했습니다. 오류: {1}
pt: {0} erro de comando: {1}

# CommandNotAllowedForConsoleError
source: You're not allowed to run this command from the server console!
it: Non puoi eseguire questo comando dalla console del server!
ko: 이 명령어를 사용할 권한이 없습니다!
pt: Você não tem permissão para executar este comando no console do servidor!

# DatabaseClosed
source: The database has been closed successfully!
it: Il database è stato chiuso con successo!
ko: 데이터베이스가 정상적으로 닫혔습니다.!
pt: O banco de dados foi fechado com sucesso!

# DatabaseCloseError
source: An error has occurred while closing the database: {0}
it: Si è verificato un errore durante la chiusura del database: {0}
ko: 데이터베이스를 끄는 도중에 오류가 발생했습니다. 오류: {0}
pt: Ocorreu um erro ao fechar o banco de dados: {0}

# DatabaseLoaded
source: The database has been loaded successfully!
it: Il database è stato caricato con successo!
ko: 데이터베이스가 정상적으로 로딩되었습니다!
pt: O banco de dados foi carregado com sucesso!

# DatabaseLoadError
source: An error has occurred while opening the database: {0}
it: Si è verificato un errore durante l'apertura del database: {0}
ko: 데이터베이스를 여는 도중에 오류가 발생했습니다. 오류 {0}
pt: Ocorreu um erro ao abrir o banco de dados: {0}

# PlayerHasLeftTheChat
source: {0} has left the chat!
it: {0} è uscito dalla chat!
ko: {0} 님이 채팅을 나가셨습니다!
pt: {0} Deixou o bate-papo

# PluginDisabled
source: {0} has been Disabled!
it: {0} è stato Disabilitato!
ko: {0} 가 꺼졌습니다!
pt: {0} foi desativado!

# PluginEnabled
source: {0} has been Enabled!
it: {0} è stato Abilitato!
ko: {0} 가 켜졌습니다!
pt: {0} foi ativado!

# PluginReloaded
source: {0} has been Reloaded!
it: {0} è stato Ricaricato!
ko: {0} 가 새로고침 되었습니다.
pt: {0} foi recarregado!

# CannotSendMessageToAlivePlayersError
source: You cannot send messages to alive players!
it: Non puoi inviare un messaggio ai giocatori in vita!
ko: 살아있는 사람한테 메세지를 보낼 수 없습니다!
pt: Você não pode enviar mensagens para jogadores ativos!

# CannotSendMessageToThemselvesError
source: You cannot send a message to yourself!
it: Non puoi inviare un messaggio a te stesso!
ko: 자신한테 메세지를 보낼 수 없습니다!
pt: Você não pode enviar uma mensagem para si mesmo!

# ChatMessageCannotBeEmptyError
source: The message cannot be empty!
it: Non puoi inviare un messaggio vuoto!
ko: 메세지란이 비어 있을 수 없습니다!
pt: A mensagem não pode estar vazia!

# ChatMessageTooLongError
source: The message is too long! Maximum length: {0}
it: Il messaggio è troppo lungo! Lunghezza massima: {0}
ko: 메세지가 너무 깁니다! 최대 메세지 수: {0}
pt: A mensagem é muito longa! Comprimento máximo: {0}

# CommandNotEnoughParametersError
source: You have to provide {0} parameter(s)! {1}
it: Devi fornire {0} parametri/o! {1}
ko: 명령어를 칠때 명령어 뒤에 {0} 개의 글자가 필요합니다(s)! {1}
pt: Você tem que fornecer {0} parametro(s)! {1}

# CommandNotEnoughPermissionsError
source: You don't have enough permissions to run this command!
it: Non hai il permesso di eseguire questo comando!
ko: 이 명령어를 칠 권한이 없습니다!
pt: Você não tem permissões suficientes para executar este comando

# CommandNotFoundError
source: Command "{0}" was not found!
it: Il comando "{0}" non è stato trovato!
ko: 명령어 "{0}" 는 없는 명령어입니다!
pt: Comando "{0}" não foi encontrado!

# CommandTooManyArgumentsError
source: Too many arguments!
it: Hai fornito troppi argomenti!
ko: 명령어 뒤에 글자가 너무 많습니다!
pt: Muitos argumentos!

# InvalidDurationError
source: {0} is an invalid duration!
it: "{0}" non è una durata valida!
ko: {0} 는 사용가능한 시간이 아닙니다!
pt: {0} é uma duração inválida!

# ListOfCommands
source: LIST OF COMMANDS ({0})
it: LISTA DEI COMANDI ({0})
ko: 커맨드 리스트: ({0})
pt: LISTA DE COMANDOS ({0})

# AddMuteCommandDescription
source: Mute a player from the chat.
it: Muta un player dalla chat.
ko: 플레이어를 채팅에서 음소거시킵니다.
pt: Silenciar um jogador do chat.

# AddMuteCommandSuccessModerator
source: "{0}" has been muted from the chat for {1} minute(s), reason: {2}
it: "{0}" è stato mutato dalla chat per {1} minuti/o, motivazione: {2}
ko: "{0}" 님이 채팅에서 {1} 분 동안 채팅에서 음소거되었습니다! 이유: {2}
pt: "{0}" foi silenciado do bate-papo por {1} minute(s), reason: {2}

# AddMuteCommandSuccessPlayer
source: You have been muted from the chat for {0} minute(s)! Reason: {1}
it: Sei stato mutato dalla chat per {0} minuti/o! Motivazione: {1}
ko: 당신은 {0} 분동안 채팅에서 음소거 되었습니다! 이유: {1}"
pt: Você foi silenciado do bate-papo por {0} minute(s)! Reason: {1}

# AddMuteCommandUsage
source: textchat mute add [Nickname/UserID/PlayerID] [Duration (Minutes)] [Reason]
it: textchat mute add [Nickname/UserID/PlayerID] [Durata (Minuti)] [Motivazione]
ko: textchat mute add [닉네임/유저ID] [시간 (분)] [이유]
pt: textchat mute add [Nickname/UserID/PlayerID] [Duração (Minutos)] [Motivo]

# NoAvailablePlayersToChatWithError
source: There are no available players to chat with!
it: Non ci sono giocatori disponibili con cui chattare!
ko: 같이 채팅할 사람이 없습니다!
pt: Não há jogadores disponíveis para conversar!

# NoCommandsToShowError
source: There are no commands to show!
it: Non è presente alcun comando!
ko: 보여줄 커맨드가 없습니다!
pt: Não há comandos para mostrar!

# PlayerIsAlreadyMutedError
source: "{0}" is already muted!
it: "{0}" è già mutato!
ko: "{0}" 는 이미 음소거 되어있습니다!
pt: "{0}" já está Silenciado!

# PlayerIsFloodingError
source: You're sending messages too fast!
it: Stai mandando messaggi troppo velocemente!
ko: 메세지를 너무 빨리 보내고 있습니다!
pt: Você está enviando mensagens muito rápido!

# PlayerIsMutedError
source: You're muted from the chat room!
it: Sei mutato dalla chat room!
ko: 당신은 채팅에서 음소거 당했습니다!
pt: Você está silenciado da sala de bate-papo!

# PlayerIsNotMutedError
source: "{0}" is not muted!
it: "{0}" non è mutato!
ko: "{0}" 는 뮤트가 안되있습니다!
pt: "{0}" Não foi Silenciado!

# PlayerNotFoundError
source: Player "{0}" was not found!
it: Il giocatore "{0}" non è stato trovato!
ko: 플레이어 "{0}" 를 찾지 못했습니다!
pt: Jogador "{0}" não foi encontrado!

source: PRIVATE
it: PRIVATA
ko: 개인
pt: PRIVADO

# PrivateChatDescription
source: Sends a private chat message to a player.
it: Invia un messaggio privato ad un altro giocatore.
ko: 플레이어에게 개인 메세지를 보냅니다.
pt: Envia uma mensagem de bate-papo particular para um jogador.

# PrivateChatUsage
source: .chat private [Nickname/UserID/PlayerID] [Message]
it: .chat private [Nickname/UserID/PlayerID] [Messaggio]
ko: .chat private [닉네임] [메세지]
pt: .chat private [Nickname/UserID/PlayerID] [Mensagem]

source: PUBLIC
it: PUBBLICA
ko: 공개

# PublicChatDescription
source: Sends a chat message to everyone in the server.
it: Invia un messaggio a tutti i giocatori presenti nel server.
ko: 서버에 있는 모든 사람한테 채팅을 보냅니다.
pt: Envia uma mensagem de bate-papo para todos no servidor.

# PublicChatUsage
source: .chat public [Message]
it: .chat public [Messaggio]
ko: .chat public [메세지]

# ReasonCannotBeEmptyError
source: The reason cannot be empty!
it: Devi fornire una motivazione!
ko: 이유란은 비어 있을수 없습니다!
pt: O motivo não pode estar vazio!

source: TEAM
it: SQUADRA
ko: 팀

# TeamChatDescription
source: Sends a chat message to your team.
it: Invia un messaggio alla tua squadra.
ko: 팀한테 메세지를 보냅니다.
pt: Envia uma mensagem de bate-papo para sua equipe.

# TeamChatUsage
source: .chat team [Message]
it: .chat team [Messaggio]
ko: .chat team [메세지]
pt: .chat team [Mensagem]

# UnmuteCommandDescription
source: Unmute a player from the chat.
it: Smuta un player dalla chat.
ko: 플레이어를 채팅에서 음소거 해제합니다.
pt: Ativar o som de um jogador do chat.

# UnmuteCommandSuccessModerator
source: "{0}" has been unmuted from the chat
it: "{0}" è stato smutato dalla chat!
ko: "{0}" 님이 채팅에서 음소거가 풀렸습니다.
pt: "{0}" foi silenciado do bate-papo

# UnmuteCommandSuccessPlayer
source: You have been unmuted from the chat!
it: Sei stato smutato dalla chat!
ko: 당신은 음소거가 풀렸습니다!
pt: Seu Mute Foi Retirado do chat!

# PlayerHasBeenChatMuted
source: You have been muted from the chat for {0} minutes, reason: {1}
it: Sei stato mutato dalla chat per {0} minuti/o, motivazione: {1}
ko: 당신은 개인 메세지를 받으셨습니다!
pt: Você foi silenciado do bate papo por {0} minutos, motivo: {1}

# PlayerReceivedPrivateMessage
source: You received a private message!
it: Hai ricevuto un messaggio privato!
ko: 당신은 채팅에서 {0} 분동안 음소거 당하셨습니다. 이유: {1}
pt: Você recebeu uma mensagem privada!

# RemoveAllMutesSuccess
source: {0} mutes have been sucessfully deleted!
it: Sono stati eliminati con successo {0} mute!

# RemoveMutesCommandDescription
source: Deletes all mutes in the database, or mutes of a specified player.
it: Elimina tutti i mute presenti nel database, oppure quelli di un giocatore specifico.

# RemoveMutesSuccess
source: {0} mutes of "{1}" have been sucessfully deleted!
it: Sono stati eliminati con successo {0} mute di "{1}"!

source: Duration
it: Durata

source: Expire
it: Scadenza

source: Issuer
it: Emittente

source: Minute(s)
it: Minuti/o

source: MUTES LIST
it: LISTA DEI MUTE

# PlayerHasJoinedTheChat
source: {0} has joined the chat!
it: {0} è entrato in chat!

source: Reason
it: Motivazione

# ShowMutesCommandDescription
source: Shows all mutes in the database, or mutes of a specified player.
it: Mostra tutti i mute presenti nel database, oppure quelli di un giocatore specifico.

source: Timestamp
it: Data

# OutdatedVersionError
source: You're running an older version of EXILED ({0}), the plugin may not be compatible with it! Recommended version: {1}
it: Stai utilizzando una vecchia versione di EXILED ({0}), il plugin potrebbe non essere compatibile con essa! Versione raccomandata: {1}

# CommandSpecifySubCommand
source: Please, specify a subcommand! Available: {0}
it: Per favore, specifica un sottocomando! Disponibili: {0}

# ChatTypeIsCurrentlyDisabledError
source: Error: "{0}" chat is currently disabled!
it: La chat "{0}" è attualmente disabilitata!

# UnmuteCommandUsage
source: textchat mute remove [Nickname/UserID/PlayerID]
ko: textchat mute remove [닉네임/유저ID]
