Repository: EliteSCP/TextChat
Catalog: TextChat/Localizations/Language.*.resx
Languages: de, ru

# ChatWelcome
source: Welcome to the chat!
de: Wilkommen im Chat!
ru: Добро пожаловать в чат!

# CommandError
source: An error has occurred while executing the command!
de: Ein Fehler ist aufgetreten, bei diesem Befehl!
ru: Произошла ошибка при активации команды!

# CommandNotAllowedForConsoleError
source: You're not allowed to run this command from the server console!
de: Dir ist es nicht erlaubt diesen Befehl auszufuehren, von der Serverkonsole!
ru: Вам не разрешено активировать эту команду через серверную консоль

# DatabaseClosed
source: The database has been closed successfully!
de: Die Datenbank wurde erfolgreich geschlossen!
ru: База данных успешно закрыта!

# DatabaseCloseError
source: An error has occurred while closing the database: {0}
de: Ein Fehler ist aufgetreten, waehrend probiert wurde die Datenbank zu schliesse : {0}
ru: Произошла ошибка при закрытии базы данных: {0}

# DatabaseLoaded
source: The database has been loaded successfully!
de: Die Datenbank wurde erfolgreich geschlossen!
ru: База данных успешно загружена!

# DatabaseLoadError
source: An error has occurred while opening the database: {0}
de: Es ist ein Fehler aufgetreten, beim oeffnen der Datenbank: {0}
ru: Произошло ошибка при открытии базы данных: {0}

# PlayerHasLeftTheChat
source: {0} has left the chat!
de: {0} hat den Chat verlassen!
ru: {0} покинул(а) чат!

# PluginDisabled
source: {0} has been Disabled!
de: {0} wurde deaktiviert!
ru: {0} был отключен!

# PluginEnabled
source: {0} has been Enabled!
de: {0} wurde aktiviert!
ru: {0} был включён!

# PluginReloaded
source: {0} has been Reloaded!
de: {0} wurde neugeladen!
ru: {0} был перезагружен!

# CannotSendMessageToAlivePlayersError
source: You cannot send messages to alive players!
de: Du kannst keine Nachrichten senden, zu Spielern die am Leben sind!
ru: Вы не можете отправлять сообщения живым игрокам!

# CannotSendMessageToThemselvesError
source: You cannot send a message to yourself!
de: Du kannst dir selbst keine Nachricht schreiben!
ru: Вы не можете отправлять сообщения самому себе!

# ChatMessageCannotBeEmptyError
source: The message cannot be empty!
de: Die Nachricht darf nicht leer sein!
ru: Сообщение не может быть пустым!

# ChatMessageTooLongError
source: The message is too long! Maximum length: {0}
de: Die Nachricht ist zu lang! Maximale länge: {0}
ru: Сообщение слишком длинное! Максимальная длина: {0}

# CommandNotEnoughParametersError
source: You have to provide {0} parameter(s)! {1}
de: Du brauchst {0} Parameter! {1}
ru: Вам нужно указать {0} параметр(а)(ов)! {1}

# CommandNotEnoughPermissionsError
source: You don't have enough permissions to run this command
de: Du darfst diesen Befehl nicht ausführen
ru: У вас нет прав для активации этой команды!

# CommandNotFoundError
source: Command "{0}" was not found!
de: Befehl "{0}" wurde nicht gefunden!
ru: Команда "{0}" не найдена!

# CommandTooManyArgumentsError
source: Too many arguments!
de: Zu viele Argumente!
ru: Слишком много аргументов!

# HelpCommandDescription
source: Gets a list of commands or the description of a single command.
de: Bekomme die Liste von allen Befehl oder die Beschreibung von einen einzelnen Befehl
ru: Выведение списка команд или описания конкретной команды.

# HelpCommandUsage
source: .chat_help/.chat_help [Command Name]
ru: .chat_help/.chat_help [Название команды]

# InvalidDurationError
source: {0} is an invalid duration!
de: {0} ist eine ungültige Dauer!
ru: {0} недопустимая продолжительность!

# ListOfCommands
source: LIST OF COMMANDS ({0})
de: LISTE VON ALLEN BEFEHLEN ({0})
ru: СПИСОК КОМАНД ({0})

# MuteCommandDescription
source: Mute a player from the chat.
de: Mute einen Spieler vom Chat.
ru: Заглушить игрока в чате.

# MuteCommandSuccessModerator
source: "{0}" has been muted from the chat for {1} minute(s), reason: {2}
de: "{0}" wurde vom Chat gemutet für {1} Minute(n), Grund: {2}
ru: "{0}" был заглушен на {1} минут(у)(ы), причина: {2}

# MuteCommandSuccessPlayer
source: You have been muted from the chat for {0} minute(s)! Reason: {1}
de: Du wurdest vom Chat gemutet für {0} Minute(n)! Grund: {1}
ru: Вы были заглушены в чате на {0} минут(у)(ы)! Причина: {1}

# MuteCommandUsage
source: chat_mute [Nickname/UserID/PlayerID] [Duration (Minutes)] [Reason]
de: chat_mute [Nickname/UserID/PlayerID] [Dauer (Minutes)] [Grund]
ru: chat_mute [Ник/UserID/PlayerID] [Продолжительность (Минуты)] [Причина]

# NoAvailablePlayersToChatWithError
source: There are no available players to chat with!
de: Es gibt keine verfügbare Spieler zum Chatten!
ru: Нет доступных игроков для чата!

# NoCommandsToShowError
source: There are no commands to show!
de: Es gibt keine Befehle zum zeigen!
ru: Нет команд для выведения!

# PlayerIsAlreadyMutedError
source: "{0}" is already muted!
de: "{0}" ist bereits gemutet!
ru: "{0}" уже заглушен!

# PlayerIsFloodingError
source: You're sending messages too fast!
de: Du sendest die Nachrichten zu schnell!
ru: Вы отправляете сообщения слишком часто!

# PlayerIsMutedError
source: You're muted from the chat room!
de: Du bist gemutet vom Chat-Raum!
ru: Вы заглушены в чате!

# PlayerIsNotMutedError
source: "{0}" is not muted!
de: "{0}" ist nicht gemuted!
ru: "{0}" не заглушен!

# PlayerNotFoundError
source: Player "{0}" was not found!
de: Player "{0}" wurde nicht gefunden!
ru: Игрок "{0}" не найден!

source: PRIVATE
de: PRIVAT
ru: ЛИЧНОЕ

# PrivateChatDescription
source: Sends a private chat message to a player.
de: Sende eine private Nachricht zu einem Spieler.
ru: Отправляет личное сообщение в чат игроку.

# PrivateChatUsage
source: .chat_private [Nickname/UserID/PlayerID] [Message]
de: .chat_private [Nickname/UserID/PlayerID] [Nachricht]
ru: .chat_private [Ник/UserID/PlayerID] [Сообщение]

source: PUBLIC
de: OEFFENTLICH
ru: ПУБЛИЧНЫЙ

# PublicChatDescription
source: Sends a chat message to everyone in the server.
de: Sende eine Nachricht zu jedem auf diesem Server.
ru: Отправляет сообщение в чат всем на сервере.

# PublicChatUsage
source: .chat [Message]
de: .chat [Nachricht]
ru: .chat [Сообщение]

# ReasonCannotBeEmptyError
source: The reason cannot be empty!
de: Der Grund darf nicht leer sein!
ru: Причина не может быть пустой!

source: TEAM
ru: КОМАНДА

# TeamChatDescription
source: Sends a chat message to your team.
de: Sende eine Nachricht zu deinem Team.
ru: Отправляет сообщение в чат команды.

# TeamChatUsage
source: .chat_team [Message]
de: .chat_team [Nachricht]
ru: .chat_team [Сообщение]

# UnmuteCommandDescription
source: Unmute a player from the chat.
de: entmuted einen Spieler vom Chat.
ru: Снять заглушку с игрока в чате.

# UnmuteCommandSuccessModerator
source: "{0}" has been unmuted from the chat
de: "{0}" wurde entmuted vom Chat
ru: "{0}" был разглушен в чате

# UnmuteCommandSuccessPlayer
source: You have been unmuted from the chat!
de: Du wurdest vom Chat entmuted!
ru: С вас сняли заглушку в чате!

# UnmuteCommandUsage
source: chat_unmute [Nickname/UserID/PlayerID]
ru: chat_unmute [Ник/UserID/PlayerID]

# PlayerHasBeenChatMuted
source: You have been muted from the chat for {0} minutes, reason: {1}
de: Du wurdest vom Chat gemuted für {0} Minute(n), Grund: {1}
ru: Вы были заглушены в чате на {0} минут, причина: {1}

# PlayerReceivedPrivateMessage
source: You received a private message!
de: Du hast eine Private Nachricht erhalten!
ru: Вы получили личное сообщение!

# DeleteAllMutesSuccess
source: {0} mutes have been sucessfully deleted!
de: {0} mutes wurden erfolgreich geloescht!
ru: {0} заглушек было удалено!

# DeleteMutesCommandDescription
source: Deletes all mutes in the database, or mutes of a specified player.
de: Loescht alle Mutes in der Datenbank oder von einen Spieler.
ru: Удаляет все заглушки из базы данных или заглушки указанного игрока.

# DeleteMutesCommandUsage
source: chat_delete_mutes/chat_delete_mutes [Nickname/UserID/PlayerID]
ru: chat_delete_mutes/chat_delete_mutes [Ник/UserID/PlayerID]

# DeleteMutesSuccess
source: {0} mutes of "{1}" have been sucessfully deleted!
de: {0} mutes von "{1}" wurden erfolgreich geloescht!
ru: {0} заглушек из "{1}" было успешно удалено!

source: Duration
de: Dauer
ru: Длительность

source: Expire
de: Verfallen
ru: Истечение

source: Issuer
de: Aussteller
ru: Админ

source: Minute(s)
de: Minute(n)
ru: Минут(ы)(у)

source: MUTES LIST
de: MUTES LISTE
ru: СПИСОК ЗАГЛУШЕННЫХ

# PlayerHasJoinedTheChat
source: {0} has joined the chat!
de: {0} ist dem Chat beigetreten!
ru: {0} вошёл в чат!

source: Reason
de: Grund
ru: Причина

# ShowMutesCommandDescription
source: Shows all mutes in the database, or mutes of a specified player.
de: Zeige alle mutes aus der Datenbank oder von einen Spieler.
ru: Показывает все заглушки из базы данных или заглушки указанного игрока.

# ShowMutesCommandUsage
source: chat_show_mutes/chat_show_mutes [Nickname/UserID/PlayerID]
ru: chat_show_mutes/chat_show_mutes [Ник/UserID/PlayerID]

source: Timestamp
de: Zeitstempel
ru: Отметка времени

# OutdatedVersionError
source: You're running an older version of EXILED ({0}), the plugin may not be compatible with it! Recommended version: {1}
de: Du benutzt eine ältere Version von EXILED ({0}), Das Plugin ist moeglicherweise nicht damit kompatibel! Empfohlene Version: {1}
ru: Вы используете старую версию EXILED ({0}), плагин может не работать корректно с этой версией! Рекомендуемая версия: {1}
